

// Описание
// 
// Параметры:
// 	ПользовательБазы - ПользовательИнформационнойБазы - 
// Возвращаемое значение:
// 	СправочникСсылка.Пользователи - 
Функция НайтиИлиСоздатьПользователя(ПользовательБазы) Экспорт
	
	ПользовательСсылка = НайтиПоНаименованию(ПользовательБазы.Имя);
	
	Если ПользовательСсылка.Пустая() Тогда
		ПользовательОбъект = СоздатьЭлемент();
		
		ПользовательОбъект.Наименование = ПользовательБазы.Имя;
		ПользовательОбъект.ПолноеИмя 	= ПользовательБазы.ПолноеИмя;
		
		ПользовательОбъект.ЗаполнитьНаборПрав(ПользовательБазы);
		ПользовательОбъект.Записать();
		
		ПользовательСсылка = ПользовательОбъект.Ссылка;
	КонецЕсли;
	
	Возврат ПользовательСсылка;
	
КонецФункции