

// Описание
// 
// Параметры:
// 	ПользовательБазы - ПользовательИнформационнойБазы - 
Процедура ЗаполнитьНаборПрав(ПользовательБазы) Экспорт
	
	РолиИБ = Метаданные.Роли;
	
	ЭтотОбъект.НаборПрав.Очистить();
	Для Каждого Роль Из РолиИБ Цикл
		
		СтрокаНабораПрав = ЭтотОбъект.НаборПрав.Добавить();
		
		СтрокаНабораПрав.ИмяРоли	 = Роль.Имя;
		СтрокаНабораПрав.СинонимРоли = Роль.Синоним;
		СтрокаНабораПрав.Активна	 = ПользовательБазы.Роли.Содержит(Роль);
		 
	КонецЦикла;
		
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	ПользовательБазы = ПользователиИнформационнойБазы.НайтиПоИмени(ЭтотОбъект.Наименование);
	
	Если ПользовательБазы = Неопределено Тогда
		ПользовательБазы = ПользователиИнформационнойБазы.СоздатьПользователя();
		ПользовательБазы.Имя 		= ЭтотОбъект.Наименование;
		ПользовательБазы.ПолноеИмя	= ЭтотОбъект.ПолноеИмя;
	КонецЕсли;
	
	ПользовательБазы.Роли.Очистить();
	НаборПравПользователя = ЭтотОбъект.НаборПрав.НайтиСтроки( Новый Структура("Активна", Истина) );
	
	Для Каждого СтрокаРолиПользователя Из НаборПравПользователя Цикл
		ТекущаяРоль = Метаданные.Роли.Найти(СтрокаРолиПользователя.ИмяРоли);
		ПользовательБазы.Роли.Добавить(ТекущаяРоль);
	КонецЦикла;
	
	ПользовательБазы.Записать();
	
КонецПроцедуры
